tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/services"
tap "twilio/brew"
brew "bash"
brew "cairo"
brew "emacs", link: false
brew "gdk-pixbuf"
brew "git"
brew "git-gui"
brew "grep"
brew "pango"
brew "gtk+3"
brew "node"
brew "jupyterlab"
brew "libffi"
brew "mysql"
brew "postgresql@14", restart_service: :changed
brew "tree"
brew "weasyprint"
brew "zsh"
cask "1password-cli"
cask "appcleaner"
cask "bartender"
cask "db-browser-for-sqlite"
cask "drawio"
cask "easydict"
cask "emacs"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-lato"
cask "font-montserrat"
cask "font-nunito"
cask "font-open-sans"
cask "font-oswald"
cask "font-poppins"
cask "font-raleway"
cask "font-roboto"
cask "font-source-code-pro"
cask "gimp"
cask "google-drive"
cask "iterm2"
cask "keyboard-maestro"
cask "lulu"
cask "miniconda"
cask "pdf-expert"
cask "pixelsnap"
cask "postman"
cask "pycharm-ce"
cask "rectangle"
cask "spotify"
cask "sublime-text"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "wine-crossover"
vscode "aaron-bond.better-comments"
vscode "adam-bender.commit-message-editor"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "batisteo.vscode-django"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "howardzuo.vscode-git-tags"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "moocfi.test-my-code"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.theme-predawnkit"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "openai.openai-chatgpt-adhoc"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "szpro.ultimatehover"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "vinirossa.vscode-gitandgithub-pack"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
